{
  "backend/main.mo": "Main canister actor providing access control, user approval flows, and domain types for products, contacts, estimates, purchases, and transactions.",
  "feature_evidence.json": "Feature evidence report listing UI layering fixes with associated files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short human‑written summaries used for reference in build planning.",
  "frontend/index.css": "Global Tailwind/OKLCH theme variables and base styles defining colors, borders, and light/dark mode behavior.",
  "frontend/index.html": "Application HTML entry point with PWA metadata, icons, and root mounting element.",
  "frontend/public/manifest.json": "PWA manifest defining icons, theme colors, display mode, metadata, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing install, activate, and network-first fetch caching with precache and runtime caching.",
  "frontend/src/App.tsx": "Root React component handling Internet Identity auth, profile setup modal, dashboard routing, and PWA prompts.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Compact access-denied UI card with optional back button for unauthorized access cases.",
  "frontend/src/components/AdminBackupModule.tsx": "Provides admin-only backup export and import UI with file validation, BigInt conversion, and confirmation dialogs.",
  "frontend/src/components/AdminPasswordModal.tsx": "Empty file placeholder for an admin password modal component.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper with header, footer, desktop navigation, mobile drawer, and main content area.",
  "frontend/src/components/BillingModule.tsx": "Full billing UI for managing estimates, branding, payments, printing, and Bluetooth printer integration.",
  "frontend/src/components/BluetoothPrinterRequirementsDialog.tsx": "Dialog displaying Bluetooth printer requirements and supports printing a formatted instruction sheet.",
  "frontend/src/components/ChangePasswordModal.tsx": "Empty file placeholder for a password change modal.",
  "frontend/src/components/ContactsModule.tsx": "Manages contacts with CRUD operations, tabbed lists, dialogs, and pending amount calculations.",
  "frontend/src/components/DashboardOverview.tsx": "Displays business overview metrics including product stats, stock value, low stock alerts, and contact counts.",
  "frontend/src/components/EstimatePrintView.tsx": "Component for printing estimates with standard or thermal formats, including browser and Bluetooth printing workflows.",
  "frontend/src/components/FinanceModule.tsx": "Renders finance dashboards with reports, filters, and print functionality for products, contacts, estimates, purchases, and transactions.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding, link to caffeine.ai, and version info.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app title, theme toggle, user menu, and mobile menu trigger.",
  "frontend/src/components/InventoryModule.tsx": "Inventory management interface for listing, filtering, and updating product stock levels.",
  "frontend/src/components/InvoicePrintView.tsx": "Empty placeholder component file for invoice printing.",
  "frontend/src/components/MobileNavDrawer.tsx": "Mobile navigation drawer wrapping PrimaryNavigation inside a sliding sheet.",
  "frontend/src/components/MobileNumberModal.tsx": "Empty placeholder component file for a mobile number modal.",
  "frontend/src/components/ModulePageHeader.tsx": "Reusable header block for module pages with title, subtitle, icon, and optional actions.",
  "frontend/src/components/PriceOverrideDialog.tsx": "Modal prompting admin approval when selling price is below cost, showing profit/loss details and confirmation actions.",
  "frontend/src/components/PrimaryNavigation.tsx": "Renders top or sidebar navigation with role‑based item visibility and module switching callbacks.",
  "frontend/src/components/ProductAutocomplete.tsx": "Searchable popover autocomplete for selecting products by name or category with search filtering.",
  "frontend/src/components/ProductsModule.tsx": "Product catalog manager with create, edit, and delete actions, forms, and admin‑restricted controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name during initial setup.",
  "frontend/src/components/PurchaseModule.tsx": "Purchase management UI handling creation, editing, deletion, line‑item pricing validation, and admin overrides.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Displays a delayed PWA install prompt handling beforeinstallprompt, installation state, and user dismissal.",
  "frontend/src/components/SetAdminPasswordModal.tsx": "Empty placeholder component file.",
  "frontend/src/components/SortControls.tsx": "Sorting controls allowing field selection and toggling ascending/descending order.",
  "frontend/src/components/UserAccessControlModule.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor based on Internet Identity, initializing access control, and refreshing dependent queries on identity change.",
  "frontend/src/hooks/useBluetoothThermalPrinter.ts": "Implements a React hook that manages Bluetooth thermal printer connection, writable characteristic discovery, printing, and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, handling user profiles, roles, backups, and domain data operations.",
  "frontend/src/hooks/useThermalQuickPreviewSettings.ts": "Manages thermal preview settings with localStorage persistence and utilities to update or reset defaults.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom theme variables including light/dark modes and overlay component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminLoginPage.tsx": "Empty placeholder page for an admin login screen.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with module switching and role-based access for admin backup tools.",
  "frontend/src/pages/LoginPage.tsx": "Displays the Internet Identity login UI and feature overview for accessing the ERP system.",
  "frontend/src/types/web-bluetooth.d.ts": "Provides TypeScript type definitions for the Web Bluetooth API, covering devices, GATT servers/services/characteristics, filters, and navigator.bluetooth.",
  "frontend/src/utils/sort.ts": "Implements generic comparison helpers for strings, numbers, bigints, and dates, plus a utility to sort filtered lists.",
  "frontend/src/utils/thermalQuickPreview.ts": "Defines thermal receipt preview settings and utilities that generate CSS for on-screen preview and print styling.",
  "frontend/src/utils/thermalReceiptEncoding.ts": "Builds ESC/POS command sequences to encode thermal receipt data, including headers, items, totals, and formatting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, border radii, animations, and scanning project files for class usage.",
  "project_state.json": "Describes the project's architecture, features, and known issues for the ERP system running on the Internet Computer."
}