{
  "backend/main.mo": "Main Motoko canister handling access control, user approval, open-access mode, and defining business types like products, contacts, estimates, and inventory.",
  "feature_evidence.json": "Feature evidence report mapping features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose and styling behavior of various frontend components and pages.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables, theming, and layout defaults for light and dark modes.",
  "frontend/index.html": "HTML entry point configuring meta tags, PWA assets, and mounting the React app.",
  "frontend/public/manifest.json": "PWA manifest detailing app metadata, theming, icons, and installation behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, cache cleanup, and offline fallbacks for the app.",
  "frontend/src/App.tsx": "Root React component that initializes identity, always renders the dashboard, and conditionally shows the profile setup modal.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple UI component showing an access-denied message with optional back navigation.",
  "frontend/src/components/AdminBackupModule.tsx": "Provides admin-only UI for exporting and importing backups with file parsing, validation, and dialog confirmations.",
  "frontend/src/components/AdminPasswordModal.tsx": "Empty placeholder file for an admin password modal component.",
  "frontend/src/components/AppShell.tsx": "Application layout wrapper managing header, footer, navigation, and mobile drawer around module content.",
  "frontend/src/components/BillingModule.tsx": "Full billing UI handling estimates, contacts, branding, printing, payments, and Bluetooth printer integration.",
  "frontend/src/components/BluetoothPrinterRequirementsDialog.tsx": "Dialog displaying Bluetooth printer requirements and generating a printable reference page.",
  "frontend/src/components/ChangePasswordModal.tsx": "Empty placeholder file for a change-password modal component.",
  "frontend/src/components/ContactsModule.tsx": "Manages creation, editing, deletion, and display of contacts with filtering and pending amount calculations.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard showing product, stock, and contact statistics with summary cards and basic analytics.",
  "frontend/src/components/EstimatePrintView.tsx": "Renders a print dialog for estimates with standard and thermal print modes, supporting browser and Bluetooth printing. Manages preview settings, printer connections, and dynamic content generation.",
  "frontend/src/components/FinanceModule.tsx": "Displays finance dashboards and reports including profit/loss, inventory, purchases, sales, and transactions. Supports filtering, data fetching, and printing formatted report views.",
  "frontend/src/components/Footer.tsx": "Simple footer showing branding, a link to caffeine.ai, and the current version number.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, user profile menu, role badges, and logout handling. Integrates authentication and responsive mobile menu support.",
  "frontend/src/components/InventoryModule.tsx": "Manages product inventory with search, sorting, and stock update dialogs. Fetches product data, checks admin permissions, and updates stock quantities.",
  "frontend/src/components/InvoicePrintView.tsx": "Empty placeholder file intended for future invoice printing functionality.",
  "frontend/src/components/MobileNavDrawer.tsx": "Mobile navigation drawer rendering sidebar navigation and handling module changes. Uses sheet layout with optional admin controls.",
  "frontend/src/components/MobileNumberModal.tsx": "Empty placeholder file for a future mobile number modal component.",
  "frontend/src/components/ModulePageHeader.tsx": "Reusable header component for module pages providing icon, title, subtitle, and optional action buttons.",
  "frontend/src/components/PriceOverrideDialog.tsx": "Displays a dialog requiring admin approval when selling below cost, showing pricing details and profit/loss calculation.",
  "frontend/src/components/PrimaryNavigation.tsx": "Renders top or sidebar navigation with module buttons, filtering admin-only items based on user role.",
  "frontend/src/components/ProductAutocomplete.tsx": "Provides a searchable popover to select products, filtering by name or category and returning the chosen product.",
  "frontend/src/components/ProductsModule.tsx": "Manages product listing, creation, editing, and deletion using dialogs and CRUD hooks.",
  "frontend/src/components/ProfileSetupModal.tsx": "Prompts authenticated users to enter their name and saves their profile via a modal form.",
  "frontend/src/components/PurchaseModule.tsx": "Handles purchasing workflow including product selection, line items, override checks, and CRUD operations for purchases.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Displays an install prompt for the PWA using the beforeinstallprompt event. Handles dismiss logic, install flow, and prevents repeated prompts.",
  "frontend/src/components/SetAdminPasswordModal.tsx": "Empty file with no implementation.",
  "frontend/src/components/SortControls.tsx": "UI controls for selecting a sort field and toggling ascending or descending order.",
  "frontend/src/components/UserAccessControlModule.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useBluetoothThermalPrinter.ts": "Provides a React hook to connect to, manage, and send print data to Bluetooth thermal printers using Web Bluetooth.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, identity persistence, and login state handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors to fetch and mutate user, product, contact, backup, and financial data.",
  "frontend/src/hooks/useThermalQuickPreviewSettings.ts": "Stores and manages thermal preview settings with localStorage persistence and reset capability.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, dark mode themes, and component overlay styling.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the application.",
  "frontend/src/pages/AdminLoginPage.tsx": "Empty page placeholder for an admin login screen.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard shell and switches between modules based on user role and selected view.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login UI with Internet Identity authentication and feature overview cards.",
  "frontend/src/types/web-bluetooth.d.ts": "Defines TypeScript interfaces for the Web Bluetooth API, adding missing device, GATT server, service, and characteristic types.",
  "frontend/src/utils/sort.ts": "Provides generic string, number, bigint, and date comparison helpers and a utility to sort filtered items.",
  "frontend/src/utils/thermalQuickPreview.ts": "Declares thermal preview settings and utilities to generate CSS for on-screen and print previews of receipts.",
  "frontend/src/utils/thermalReceiptEncoding.ts": "Implements ESC/POS command generation to encode receipt data into printer-ready byte sequences.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, border radii, animations, and enabling plugins for animation and typography.",
  "project_state.json": "Metadata describing the project’s architecture, features, and known issues for the ERP system."
}