{
  "backend/main.mo": "Main Motoko canister defining access control, user approval, product/contact types, estimate structures, and admin-protected mutation/query methods.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend files for reference.",
  "frontend/index.css": "Tailwind base and theme variable definitions with light/dark palettes and global styling rules.",
  "frontend/index.html": "HTML entry point loading the React app, PWA metadata, and app icons.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, and theme configuration.",
  "frontend/public/sw.js": "Service worker handling precaching, runtime caching, cache cleanup, and network‑first fetch logic.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile checks, dashboard rendering, PWA prompt, and theme provider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component showing an access‑denied message with optional back navigation.",
  "frontend/src/components/AdminBackupModule.tsx": "Provides UI for exporting data to a JSON file and importing backups, including confirmation dialogs and query invalidation.",
  "frontend/src/components/AdminPasswordModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/AppShell.tsx": "Wraps the main app layout with header, mobile navigation, and focused overlay handling.",
  "frontend/src/components/BillingModule.tsx": "Handles listing estimates, recording payments, managing branding, and syncing estimates to IndexedDB.",
  "frontend/src/components/BluetoothPrinterRequirementsDialog.tsx": "Displays a dialog describing Bluetooth printer requirements and supports printing a formatted info page.",
  "frontend/src/components/ChangePasswordModal.tsx": "Empty file with no implemented content.",
  "frontend/src/components/ContactsModule.tsx": "Manages viewing, adding, editing, and deleting contacts with dialog forms and pending amount calculations.",
  "frontend/src/components/DashboardOverview.tsx": "Shows high-level stats for products and contacts, including stock value, low stock count, and category summaries.",
  "frontend/src/components/EstimatePrintView.tsx": "A dialog component for printing estimates with browser or Bluetooth printers, including thermal preview settings and encoding logic.",
  "frontend/src/components/FinanceModule.tsx": "Displays finance reports with filters and printing support, pulling data for products, contacts, estimates, purchases, and transactions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing branding, external link, and version info.",
  "frontend/src/components/Header.tsx": "Top navigation header handling authentication, desktop navigation, and mobile menu toggle.",
  "frontend/src/components/InventoryModule.tsx": "Inventory management UI for viewing, searching, and updating product stock levels with admin checks.",
  "frontend/src/components/InvoicePrintView.tsx": "Empty placeholder file for invoice printing.",
  "frontend/src/components/MobileNavDrawer.tsx": "Mobile navigation drawer rendering module links and closing on selection.",
  "frontend/src/components/MobileNumberModal.tsx": "Empty placeholder file for a mobile number modal.",
  "frontend/src/components/ModulePageHeader.tsx": "Reusable header component for module pages with title, subtitle, icon, and optional actions.",
  "frontend/src/components/PriceOverrideDialog.tsx": "Confirmation dialog showing loss details when selling below cost and requiring admin override approval.",
  "frontend/src/components/PrimaryNavigation.tsx": "Renders top or sidebar navigation with module switching and optional admin‑only items.",
  "frontend/src/components/ProductAutocomplete.tsx": "Product search and selection popover with guarded selection handling and filtered results.",
  "frontend/src/components/ProductsModule.tsx": "Full CRUD interface for managing products, including list display and admin‑restricted add/edit dialogs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Mandatory setup modal allowing authenticated users to save their display name.",
  "frontend/src/components/PurchaseModule.tsx": "Complete purchase management UI with line items, profit checks, override prompts, and admin controls.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Shows a deferred install prompt for the PWA, handling dismissal, timing, and installation events.",
  "frontend/src/components/SetAdminPasswordModal.tsx": "Empty placeholder file with no implemented component.",
  "frontend/src/components/SortControls.tsx": "UI controls for selecting a sort field and toggling ascending or descending order.",
  "frontend/src/components/ThermalReceiptPreview.tsx": "Renders a styled thermal receipt preview using estimate data and adjustable layout settings.",
  "frontend/src/components/UserAccessControlModule.tsx": "Empty file with no implementation.",
  "frontend/src/context/FocusedOverlayContext.tsx": "Provides context for managing active overlays and locks body scroll while overlays are active.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBluetoothThermalPrinter.ts": "Hook for connecting to, managing, and printing to a Bluetooth thermal printer with error handling.",
  "frontend/src/hooks/useHashRoute.ts": "Implements a hash-based routing system with parsing and navigation helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login logic, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as profiles, roles, products, and backups.",
  "frontend/src/hooks/useThermalQuickPreviewSettings.ts": "Manages thermal preview settings with localStorage persistence and supports updates and reset to defaults.",
  "frontend/src/index.css": "Defines Tailwind base layers, light/dark theme CSS variables, Radix overlay z-index rules, and thermal receipt print/preview styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AdminLoginPage.tsx": "Empty placeholder page file with no content.",
  "frontend/src/pages/Dashboard.tsx": "Controls module switching and focused routes for the dashboard based on hash routing and user role, rendering appropriate modules within an AppShell.",
  "frontend/src/pages/EstimateEditorPage.tsx": "Implements create/edit estimate workflow with form state, line items, customer selection, validation, and focused overlay handling.",
  "frontend/src/pages/EstimatePrintPreviewPage.tsx": "Loads estimate print data, renders a thermal receipt preview, and supports browser and Bluetooth thermal printing with Unicode detection.",
  "frontend/src/pages/LoginPage.tsx": "Displays login UI using Internet Identity with descriptive cards for system features and roles.",
  "frontend/src/types/web-bluetooth.d.ts": "Provides TypeScript type definitions for Web Bluetooth APIs missing from standard libs.",
  "frontend/src/utils/backupFileIO.ts": "Exports IndexedDB data to a JSON backup file and restores it by parsing, converting BigInt fields, clearing stores, and writing records back.",
  "frontend/src/utils/indexedDbClient.ts": "Provides a wrapper around IndexedDB with schema-defined stores and methods for opening the DB, reading, writing, batching, and clearing data.",
  "frontend/src/utils/purchasePrice.ts": "Finds the latest matching purchase for a product and returns its selling price or a fallback price.",
  "frontend/src/utils/sort.ts": "Contains generic comparison helpers for strings, numbers, bigints, dates, and a utility to sort filtered lists.",
  "frontend/src/utils/thermalQuickPreview.ts": "Defines thermal receipt preview settings and generates CSS styles for on-screen preview and print formatting.",
  "frontend/src/utils/thermalReceiptEncoding.ts": "Builds ESC/POS command bytes to print structured thermal receipts using text, alignment, formatting, and layout helpers.",
  "frontend/src/utils/thermalReceiptRaster.ts": "Renders a thermal receipt to a canvas and converts it into raster ESC/POS bitmap data for printing.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash), persist them in sessionStorage, retrieve them with fallback, and remove them from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, border radii, animations, and loading plugins for animations and typography.",
  "project_state.json": "Defines the project’s state, requirements, issues, and ERP-style billing module feature set including estimates, invoices, inventory, and payments."
}