{
  "backend/main.mo": "Primary Motoko canister implementing authorization, user approvals, and domain types for products, contacts, estimates, purchases, and transactions with admin‑gated approval management APIs.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind-based global style sheet defining OKLCH theme variables for light and dark modes and applying base layout styles.",
  "frontend/index.html": "PWA-enabled HTML entry point defining metadata, theme color, icons, and root mount container for the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, theme colors, categories, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing precache, runtime cache, and network‑first fetch strategy with cache cleanup and offline fallback.",
  "frontend/src/App.tsx": "Root React component handling Internet Identity auth, profile setup gating, theme provider, and rendering Login or Dashboard.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component displaying an access denied message with optional back navigation using card-based layout.",
  "frontend/src/components/AdminBackupModule.tsx": "UI for admins to export and import full backup JSON files with validation, BigInt handling, and confirmation dialogs.",
  "frontend/src/components/AdminPasswordModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, footer, navigation, and main content area with responsive sidebar and mobile nav.",
  "frontend/src/components/BillingModule.tsx": "Full billing workflow including estimate creation, editing, payment recording, branding settings, printing, and Bluetooth printer integration.",
  "frontend/src/components/BluetoothPrinterRequirementsDialog.tsx": "Dialog explaining Bluetooth printing requirements and generating a printable reference page with styling.",
  "frontend/src/components/ChangePasswordModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/ContactsModule.tsx": "Manages contacts with add, edit, delete dialogs, categorization, and pending amount calculation tied to estimates.",
  "frontend/src/components/DashboardOverview.tsx": "Displays product, stock, and contact summary metrics with loading states and dashboard cards.",
  "frontend/src/components/EstimatePrintView.tsx": "Provides UI and logic for printing estimates via browser or Bluetooth, including thermal formatting and printer connection handling.",
  "frontend/src/components/FinanceModule.tsx": "Displays finance dashboards and reports with filters and print functionality using various data queries.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with user info, role badge, theme toggle, and logout handling.",
  "frontend/src/components/InventoryModule.tsx": "Manages product inventory with search, stock updates, and admin-only editing.",
  "frontend/src/components/InvoicePrintView.tsx": "Empty placeholder component for invoice printing.",
  "frontend/src/components/MobileNumberModal.tsx": "Empty placeholder component for a mobile number modal.",
  "frontend/src/components/ModulePageHeader.tsx": "Reusable header component for module pages with title, icon, subtitle, and optional actions.",
  "frontend/src/components/PriceOverrideDialog.tsx": "Modal prompting admin approval when selling price is below cost, showing price details and triggering override callback.",
  "frontend/src/components/PrimaryNavigation.tsx": "Renders sidebar or bottom navigation with modules, filtering admin‑only items based on user role.",
  "frontend/src/components/ProductAutocomplete.tsx": "Searchable popover-based product selector with filtering, highlighting, and selection callbacks.",
  "frontend/src/components/ProductsModule.tsx": "CRUD interface for products with validation, dialogs for add/edit/delete, and admin-based access control.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal requiring user to enter and save their display name during initial profile setup.",
  "frontend/src/components/PurchaseModule.tsx": "Manages purchase creation and editing with line items, pricing validation, override workflow, and CRUD operations.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Handles PWA install prompt display, dismissal logic, and triggering installation.",
  "frontend/src/components/SetAdminPasswordModal.tsx": "Empty component file with no implementation.",
  "frontend/src/components/SortControls.tsx": "Provides dropdown and toggle button for selecting sort field and direction.",
  "frontend/src/components/UserAccessControlModule.tsx": "Empty component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actor tied to identity, initializes access control, and refreshes dependent queries on change.",
  "frontend/src/hooks/useBluetoothThermalPrinter.ts": "Provides a React hook for connecting to and printing via Bluetooth thermal printers, managing connection state and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook handling login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including user, product, backup, and role-related operations.",
  "frontend/src/hooks/useThermalQuickPreviewSettings.ts": "Manages thermal preview settings with localStorage persistence and update/reset helpers.",
  "frontend/src/index.css": "Sets global Tailwind styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/AdminLoginPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard and switches between modules based on user selection and admin role.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login screen allowing users to authenticate via Internet Identity.",
  "frontend/src/types/web-bluetooth.d.ts": "Provides TypeScript interfaces and type definitions for the Web Bluetooth API missing from the standard library.",
  "frontend/src/utils/sort.ts": "Implements basic comparison helpers for strings, numbers, bigints, and dates plus a utility to apply sorting after filtering.",
  "frontend/src/utils/thermalQuickPreview.ts": "Defines thermal preview settings and utilities to generate CSS styles for on-screen and print previews of receipts.",
  "frontend/src/utils/thermalReceiptEncoding.ts": "Builds ESC/POS command sequences to encode thermal receipt content based on printer settings and provided data.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with fallback to sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, border radii, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project architecture, features, issues, and versioned internal state."
}