{
  "kind": "build_request",
  "title": "Improve UI background clarity and modal contrast (reduce confusing overlap)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Fix the confusing/unclear background layering shown in the uploaded screenshot by making dialogs/modals clearly foregrounded and the underlying page clearly dimmed (not visually blending with the modal). Apply the fix consistently to dialogs across modules (e.g., Contacts add/edit dialog and other module dialogs).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Not happy, still the background is confusing make it clear and visible",
          "Screenshot_20260208-213057.png"
        ]
      },
      "acceptanceCriteria": [
        "When any Dialog/Modal is open, the page behind it is uniformly dimmed with a clearly visible overlay (no patchy/see-through blending that makes the background look like part of the modal).",
        "Dialog content uses a solid, opaque surface (e.g., card/background) with clear border/shadow so the modal is visually distinct from the background.",
        "Text and form fields inside the modal remain high-contrast and readable in both light and dark themes.",
        "The ContactsModule “Add New Contact” dialog (and edit dialog) matches this improved behavior."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Ensure the app shell and module content do not visually overlap or “double show” behind overlays/drawers: verify z-index stacking and backgrounds for Header, top navigation, main content container, and mobile drawer so foreground content is always clearly separated from background elements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "still the background is confusing make it clear and visible"
        ]
      },
      "acceptanceCriteria": [
        "Header and top navigation remain clearly separated from the page (solid background + border) and do not visually bleed into underlying content when scrolling.",
        "On mobile, opening the navigation drawer shows a clear, distinct drawer surface over a dimmed background; underlying module content does not compete visually with the drawer.",
        "No UI state shows both navigation overlay and module content in a way that appears merged (consistent separation on all modules)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only component sources); apply fixes via composition (props/className) and/or global CSS (e.g., frontend/src/index.css).",
    "Do not add or integrate any payment, billing, subscription, or credit-debit logic; this change request is UI clarity only."
  ],
  "nonGoals": [
    "Handling user billing, refunds, credits, or payment disputes.",
    "Changing ERP domain behavior (products, inventory, contacts, billing, purchasing, finance calculations)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}