{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve modal/drawer layering, overlay dimming, and surface contrast across the app",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Make all dialogs/modals clearly foregrounded with a uniform dimmed overlay and an opaque, high-contrast modal surface across modules (including Contacts add/edit).",
      "acceptanceCriteria": [
        "When any Dialog/Modal is open, the page behind it is uniformly dimmed with a clearly visible overlay (no patchy/see-through blending that makes the background look like part of the modal).",
        "Dialog content uses a solid, opaque surface (e.g., card/background) with clear border/shadow so the modal is visually distinct from the background.",
        "Text and form fields inside the modal remain high-contrast and readable in both light and dark themes.",
        "The ContactsModule “Add New Contact” dialog (and edit dialog) matches this improved behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global styling overrides for shadcn-ui (Radix) Dialog/AlertDialog layering: enforce a uniform, opaque overlay dim (light/dark), ensure overlay/content z-index ordering above the app shell, and ensure dialog surfaces are fully opaque with consistent border/shadow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ContactsModule.tsx",
          "operation": "modify",
          "description": "Update the shadcn-ui Dialog usage to pass an explicit DialogContent className that ensures an opaque surface (bg/background), clear border, and stronger shadow; apply consistently for both add and edit contact flows. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Strengthen shadcn-ui DialogContent visual separation by adding/adjusting className for an opaque surface and readable typography in light/dark themes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PriceOverrideDialog.tsx",
          "operation": "modify",
          "description": "Ensure the shadcn-ui DialogContent has a solid surface and clear elevation (border/shadow) so pricing warning modal is visually distinct from the background. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BluetoothPrinterRequirementsDialog.tsx",
          "operation": "modify",
          "description": "Adjust the shadcn-ui DialogContent container styling (via className) to ensure the dialog surface is opaque and readable; avoid any background blending inside the scrollable content area. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminBackupModule.tsx",
          "operation": "modify",
          "description": "Update shadcn-ui AlertDialogContent styling (via className) so confirmation dialogs use an opaque surface with clear border/shadow and remain distinct over the dimmed overlay. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Prevent visual overlap between app shell (Header/top nav/content) and overlays/drawers by verifying stacking contexts, z-index, and solid backgrounds for header/nav and mobile drawer.",
      "acceptanceCriteria": [
        "Header and top navigation remain clearly separated from the page (solid background + border) and do not visually bleed into underlying content when scrolling.",
        "On mobile, opening the navigation drawer shows a clear, distinct drawer surface over a dimmed background; underlying module content does not compete visually with the drawer.",
        "No UI state shows both navigation overlay and module content in a way that appears merged (consistent separation on all modules)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Verify and adjust header stacking/background behavior: ensure header background is solid/opaque, maintains separation while sticky, and does not visually blend with underlying content (including while overlays are open)."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Verify overall layout stacking contexts for header/top navigation/main container so overlays (dialogs/sheets) always appear above shell elements and the shell never appears 'double shown' behind them; adjust container classes if needed (no changes to ui component sources)."
        },
        {
          "path": "frontend/src/components/MobileNavDrawer.tsx",
          "operation": "modify",
          "description": "Strengthen shadcn-ui SheetContent surface styling (via className) so the drawer has a clear, opaque panel with distinct border/shadow; rely on global overlay dimming for background separation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust global stacking + overlay styles affecting shadcn-ui Sheet (drawer) and other portals: ensure overlay dim is uniform and that drawer/modal portals have consistent z-index above header/nav/content across modules. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}