{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Open access: remove Internet Identity login gating from the ERP frontend",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Always render the main Dashboard flow (AppShell + modules) without requiring Internet Identity login and without showing the LoginPage as a gate.",
      "acceptanceCriteria": [
        "Opening the app in a fresh browser session shows the Dashboard (not the LoginPage) without any login action.",
        "No user-facing message implies that login is required to use core modules (Products, Inventory, Contacts, Purchasing, Billing, Finance)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the root render flow to always show the main Dashboard UI instead of conditionally gating on Internet Identity authentication (do not route/branch to LoginPage). Keep existing initialization/loading handling, but remove login-blocking. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Disable first-time profile setup gating in open mode so anonymous users are never prompted with ProfileSetupModal.",
      "acceptanceCriteria": [
        "When not logged in, the ProfileSetupModal never appears.",
        "The app remains usable without creating/saving a user profile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure ProfileSetupModal is strictly conditioned on authenticated state (and does not appear for anonymous/open access users), even while the rest of the app renders. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Add a defensive guard so the modal cannot be shown/used in anonymous mode (e.g., early-return null when the app is not authenticated) to prevent future regressions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Fetch and resolve roles in open mode by allowing role queries to run without an Internet Identity (anonymous actor), so admin/role-gated UI works (e.g., Backup module visibility/access).",
      "acceptanceCriteria": [
        "The app can fetch and display a user role even when not logged in (no Internet Identity identity present).",
        "Admin-only sections that depend on role (e.g., Backup module) are accessible in open mode when the backend reports an admin role."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the role-fetching query (useGetCallerUserRole) to execute when an actor is available even if no Internet Identity is present (anonymous mode). Update query keying to remain stable for anonymous callers and avoid unnecessary refetch loops. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure admin gating for the Backup module relies on the resolved role from useGetCallerUserRole in open mode (handle loading/undefined role states gracefully so the UI updates once role is fetched). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PrimaryNavigation.tsx",
          "operation": "modify",
          "description": "Ensure admin-only navigation visibility (Backup) updates correctly based on the role fetched in open mode (anonymous callers), including initial/loading states. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}